theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*! @brief Set the ZCE6 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE6(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE6_MASK, ADC_ZXCTRL1_ZCE6(value)))
#define ADC_BWR_ZXCTRL1_ZCE6(base, value) (ADC_WR_ZXCTRL1_ZCE6(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL1, field ZCE7[15:14] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL1_ZCE7 field. */
#define ADC_RD_ZXCTRL1_ZCE7(base) ((ADC_ZXCTRL1_REG(base) & ADC_ZXCTRL1_ZCE7_MASK) >> ADC_ZXCTRL1_ZCE7_SHIFT)
#define ADC_BRD_ZXCTRL1_ZCE7(base) (ADC_RD_ZXCTRL1_ZCE7(base))

/*! @brief Set the ZCE7 field to a new value. */
#define ADC_WR_ZXCTRL1_ZCE7(base, value) (ADC_RMW_ZXCTRL1(base, ADC_ZXCTRL1_ZCE7_MASK, ADC_ZXCTRL1_ZCE7(value)))
#define ADC_BWR_ZXCTRL1_ZCE7(base, value) (ADC_WR_ZXCTRL1_ZCE7(base, value))
/*@}*/

/*******************************************************************************
 * ADC_ZXCTRL2 - ADC Zero Crossing Control 2 Register
 ******************************************************************************/

/*!
 * @brief ADC_ZXCTRL2 - ADC Zero Crossing Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ADC_ZXCTRL2 register
 */
/*@{*/
#define ADC_RD_ZXCTRL2(base)     (ADC_ZXCTRL2_REG(base))
#define ADC_WR_ZXCTRL2(base, value) (ADC_ZXCTRL2_REG(base) = (value))
#define ADC_RMW_ZXCTRL2(base, mask, value) (ADC_WR_ZXCTRL2(base, (ADC_RD_ZXCTRL2(base) & ~(mask)) | (value)))
#define ADC_SET_ZXCTRL2(base, value) (ADC_WR_ZXCTRL2(base, ADC_RD_ZXCTRL2(base) |  (value)))
#define ADC_CLR_ZXCTRL2(base, value) (ADC_WR_ZXCTRL2(base, ADC_RD_ZXCTRL2(base) & ~(value)))
#define ADC_TOG_ZXCTRL2(base, value) (ADC_WR_ZXCTRL2(base, ADC_RD_ZXCTRL2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_ZXCTRL2 bitfields
 */

/*!
 * @name Register ADC_ZXCTRL2, field ZCE8[1:0] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE8 field. */
#define ADC_RD_ZXCTRL2_ZCE8(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE8_MASK) >> ADC_ZXCTRL2_ZCE8_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE8(base) (ADC_RD_ZXCTRL2_ZCE8(base))

/*! @brief Set the ZCE8 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE8(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE8_MASK, ADC_ZXCTRL2_ZCE8(value)))
#define ADC_BWR_ZXCTRL2_ZCE8(base, value) (ADC_WR_ZXCTRL2_ZCE8(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL2, field ZCE9[3:2] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE9 field. */
#define ADC_RD_ZXCTRL2_ZCE9(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE9_MASK) >> ADC_ZXCTRL2_ZCE9_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE9(base) (ADC_RD_ZXCTRL2_ZCE9(base))

/*! @brief Set the ZCE9 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE9(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE9_MASK, ADC_ZXCTRL2_ZCE9(value)))
#define ADC_BWR_ZXCTRL2_ZCE9(base, value) (ADC_WR_ZXCTRL2_ZCE9(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL2, field ZCE10[5:4] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE10 field. */
#define ADC_RD_ZXCTRL2_ZCE10(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE10_MASK) >> ADC_ZXCTRL2_ZCE10_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE10(base) (ADC_RD_ZXCTRL2_ZCE10(base))

/*! @brief Set the ZCE10 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE10(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE10_MASK, ADC_ZXCTRL2_ZCE10(value)))
#define ADC_BWR_ZXCTRL2_ZCE10(base, value) (ADC_WR_ZXCTRL2_ZCE10(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL2, field ZCE11[7:6] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE11 field. */
#define ADC_RD_ZXCTRL2_ZCE11(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE11_MASK) >> ADC_ZXCTRL2_ZCE11_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE11(base) (ADC_RD_ZXCTRL2_ZCE11(base))

/*! @brief Set the ZCE11 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE11(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE11_MASK, ADC_ZXCTRL2_ZCE11(value)))
#define ADC_BWR_ZXCTRL2_ZCE11(base, value) (ADC_WR_ZXCTRL2_ZCE11(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL2, field ZCE12[9:8] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE12 field. */
#define ADC_RD_ZXCTRL2_ZCE12(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE12_MASK) >> ADC_ZXCTRL2_ZCE12_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE12(base) (ADC_RD_ZXCTRL2_ZCE12(base))

/*! @brief Set the ZCE12 field to a new value. */
#define ADC_WR_ZXCTRL2_ZCE12(base, value) (ADC_RMW_ZXCTRL2(base, ADC_ZXCTRL2_ZCE12_MASK, ADC_ZXCTRL2_ZCE12(value)))
#define ADC_BWR_ZXCTRL2_ZCE12(base, value) (ADC_WR_ZXCTRL2_ZCE12(base, value))
/*@}*/

/*!
 * @name Register ADC_ZXCTRL2, field ZCE13[11:10] (RW)
 *
 * Values:
 * - 00 - Zero Crossing disabled
 * - 01 - Zero Crossing enabled for positive to negative sign change
 * - 10 - Zero Crossing enabled for negative to positive sign change
 * - 11 - Zero Crossing enabled for any sign change
 */
/*@{*/
/*! @brief Read current value of the ADC_ZXCTRL2_ZCE13 field. */
#define ADC_RD_ZXCTRL2_ZCE13(base) ((ADC_ZXCTRL2_REG(base) & ADC_ZXCTRL2_ZCE13_MASK) >> ADC_ZXCTRL2_ZCE13_SHIFT)
#define ADC_BRD_ZXCTRL2_ZCE13(base) (ADC_RD_ZXCTRL2_ZCE13(base))

