theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*******************************************************************************
 * ADC_SDIS - ADC Sample Disable Register
 ******************************************************************************/

/*!
 * @brief ADC_SDIS - ADC Sample Disable Register (RW)
 *
 * Reset value: 0xF0F0U
 *
 * Each bit of ADC_SDIS corresponds to a SAMPLEx filed in one or multiple
 * ADC_CLISTn registers. For example, bit 0 of ADC_SDIS enables/disables CLIST0 and bit
 * 15 of ADC_SDIS enables/disables CLIST15. If an ADC_SDIS bit is clear, then
 * the correspopnding SAMPLEx field is enabled in an ADC scan. If the ADC_SDIS bit
 * is set, then the corresponding SAMPLEx field is disabled and the ADC scan is
 * halted and subsequent ADC acquisition also does not occur. Remembering that the
 * ADC sequentially scans in order SAMPLE0, SAMPLE1, SAMPLE2, etc thus if
 * ADC_SDIS = 0xFFF7, then an ADC scan acquires SAMPLE0 while SAMPLE1, SAMPLE2, and all
 * other acquistions do not occur. The 4-bit wide SAMPLEx fields are found in
 * the ADC_CLISTn registers which select a particular ADC channel and whether it is
 * a differential or single ended conversion.
 */
/*!
 * @name Constants and macros for entire ADC_SDIS register
 */
/*@{*/
#define ADC_RD_SDIS(base)        (ADC_SDIS_REG(base))
#define ADC_WR_SDIS(base, value) (ADC_SDIS_REG(base) = (value))
#define ADC_RMW_SDIS(base, mask, value) (ADC_WR_SDIS(base, (ADC_RD_SDIS(base) & ~(mask)) | (value)))
#define ADC_SET_SDIS(base, value) (ADC_WR_SDIS(base, ADC_RD_SDIS(base) |  (value)))
#define ADC_CLR_SDIS(base, value) (ADC_WR_SDIS(base, ADC_RD_SDIS(base) & ~(value)))
#define ADC_TOG_SDIS(base, value) (ADC_WR_SDIS(base, ADC_RD_SDIS(base) ^  (value)))
/*@}*/

/*******************************************************************************
 * ADC_STAT - ADC Status Register
 ******************************************************************************/

/*!
 * @brief ADC_STAT - ADC Status Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register provides the current status of the ADC module. STAT[HLMTI and
 * LLMTI] bits are cleared by writing 1s to all asserted bits in the limit status
 * register, LIMSTAT. Likewise, the STAT[ZCI] bit, is cleared by writing 1s to
 * all asserted bits in the zero crossing status register, ZXSTAT. The STAT[EOSIx]
 * bits are cleared by writing a one to them. Except for STAT[CIP0 and CIP1] this
 * register's bits are sticky. Once set to a one state, they require some
 * specific action to clear them. They are not cleared automatically on the next scan
 * sequence.
 */
/*!
 * @name Constants and macros for entire ADC_STAT register
 */
/*@{*/
#define ADC_RD_STAT(base)        (ADC_STAT_REG(base))
#define ADC_WR_STAT(base, value) (ADC_STAT_REG(base) = (value))
#define ADC_RMW_STAT(base, mask, value) (ADC_WR_STAT(base, (ADC_RD_STAT(base) & ~(mask)) | (value)))
#define ADC_SET_STAT(base, value) (ADC_WR_STAT(base, ADC_RD_STAT(base) |  (value)))
#define ADC_CLR_STAT(base, value) (ADC_WR_STAT(base, ADC_RD_STAT(base) & ~(value)))
#define ADC_TOG_STAT(base, value) (ADC_WR_STAT(base, ADC_RD_STAT(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_STAT bitfields
 */

/*!
 * @name Register ADC_STAT, field UNDEFINED[7:0] (RO)
 *
 * This read-only bitfield is undefined and will always contain random data.
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_UNDEFINED field. */
#define ADC_RD_STAT_UNDEFINED(base) ((ADC_STAT_REG(base) & ADC_STAT_UNDEFINED_MASK) >> ADC_STAT_UNDEFINED_SHIFT)
#define ADC_BRD_STAT_UNDEFINED(base) (ADC_RD_STAT_UNDEFINED(base))
/*@}*/

/*!
 * @name Register ADC_STAT, field HLMTI[8] (RO)
 *
 * If the respective high limit register is enabled by having a value other than
 * 7FF8h, high limit checking is enabled. This interrupt asserts at the
 * completion of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active LIMSTAT[HLS] bits.
 *
 * Values:
 * - 0 - No high limit interrupt request
 * - 1 - High limit exceeded, IRQ pending if CTRL1[HLMTIE] is set
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_HLMTI field. */
#define ADC_RD_STAT_HLMTI(base) ((ADC_STAT_REG(base) & ADC_STAT_HLMTI_MASK) >> ADC_STAT_HLMTI_SHIFT)
#define ADC_BRD_STAT_HLMTI(base) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_HLMTI_SHIFT))
/*@}*/

/*!
 * @name Register ADC_STAT, field LLMTI[9] (RO)
 *
 * If the respective low limit register is enabled by having a value other than
 * 0000h, low limit checking is enabled. This interrupt asserts at the completion
 * of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active LIMSTAT[LLS] bits.
 *
 * Values:
 * - 0 - No low limit interrupt request
 * - 1 - Low limit exceeded, IRQ pending if CTRL1[LLMTIE] is set
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_LLMTI field. */
#define ADC_RD_STAT_LLMTI(base) ((ADC_STAT_REG(base) & ADC_STAT_LLMTI_MASK) >> ADC_STAT_LLMTI_SHIFT)
#define ADC_BRD_STAT_LLMTI(base) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_LLMTI_SHIFT))
/*@}*/

/*!
 * @name Register ADC_STAT, field ZCI[10] (RO)
 *
 * If the respective offset register is configured by having a value greater
 * than 0000h, zero crossing checking is enabled. If the offset register is
 * programmed with 7FF8h, the result will always be less than or equal to zero. On the
 * other hand, if 0000h is programmed into the offset register, the result will
 * always be greater than or equal to zero, and no zero crossing can occur because
 * the sign of the result will not change. This interrupt asserts at the
 * completion of an individual conversion which may or may not be the end of a scan. This
 * bit is cleared by writing a "1" to all active ZXSTAT[ZCS] bits.
 *
 * Values:
 * - 0 - No zero crossing interrupt request
 * - 1 - Zero crossing encountered, IRQ pending if CTRL1[ZCIE] is set
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_ZCI field. */
#define ADC_RD_STAT_ZCI(base) ((ADC_STAT_REG(base) & ADC_STAT_ZCI_MASK) >> ADC_STAT_ZCI_SHIFT)
#define ADC_BRD_STAT_ZCI(base) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_ZCI_SHIFT))
/*@}*/

/*!
 * @name Register ADC_STAT, field EOSI0[11] (W1C)
 *
 * This bit indicates whether a scan of analog inputs have been completed since
 * the last read of the status register or since a reset. This bit is cleared by
 * writing a one to it. This bit cannot be set by software. STAT[EOSI0] is the
 * preferred bit to poll for scan completion if interrupts are not enabled. In
 * looping scan modes, this interrupt is triggered at the completion of each
 * iteration of the loop. This interrupt is triggered upon the completion of any scan
 * except for the completion of a B converter scan in non-simultaneous parallel scan
 * modes.
 *
 * Values:
 * - 0 - A scan cycle has not been completed, no end of scan IRQ pending
 * - 1 - A scan cycle has been completed, end of scan IRQ pending
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_EOSI0 field. */
#define ADC_RD_STAT_EOSI0(base) ((ADC_STAT_REG(base) & ADC_STAT_EOSI0_MASK) >> ADC_STAT_EOSI0_SHIFT)
#define ADC_BRD_STAT_EOSI0(base) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_EOSI0_SHIFT))

/*! @brief Set the EOSI0 field to a new value. */
#define ADC_WR_STAT_EOSI0(base, value) (ADC_RMW_STAT(base, (ADC_STAT_EOSI0_MASK | ADC_STAT_EOSI1_MASK), ADC_STAT_EOSI0(value)))
#define ADC_BWR_STAT_EOSI0(base, value) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_EOSI0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_STAT, field EOSI1[12] (W1C)
 *
 * This bit indicates whether a scan of analog inputs have been completed since
 * the last read of the status register or since a reset. This bit is cleared by
 * writing a one to it. This bit cannot be set by software. In looping scan
 * modes, this interrupt is triggered at the completion of each iteration of the loop.
 * This interrupt is triggered only by the completion of a B converter scan in
 * non-simultaneous parallel scan modes.
 *
 * Values:
 * - 0 - A scan cycle has not been completed, no end of scan IRQ pending
 * - 1 - A scan cycle has been completed, end of scan IRQ pending
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_EOSI1 field. */
#define ADC_RD_STAT_EOSI1(base) ((ADC_STAT_REG(base) & ADC_STAT_EOSI1_MASK) >> ADC_STAT_EOSI1_SHIFT)
#define ADC_BRD_STAT_EOSI1(base) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_EOSI1_SHIFT))

/*! @brief Set the EOSI1 field to a new value. */
#define ADC_WR_STAT_EOSI1(base, value) (ADC_RMW_STAT(base, (ADC_STAT_EOSI1_MASK | ADC_STAT_EOSI0_MASK), ADC_STAT_EOSI1(value)))
#define ADC_BWR_STAT_EOSI1(base, value) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_EOSI1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register ADC_STAT, field CIP1[14] (RO)
 *
 * This bit indicates whether a scan is in progress. This refers only to a B
 * converter scan in non-simultaneous parallel scan modes.
 *
 * Values:
 * - 0 - Idle state
 * - 1 - A scan cycle is in progress. The ADC will ignore all sync pulses or
 *     start commands
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_CIP1 field. */
#define ADC_RD_STAT_CIP1(base) ((ADC_STAT_REG(base) & ADC_STAT_CIP1_MASK) >> ADC_STAT_CIP1_SHIFT)
#define ADC_BRD_STAT_CIP1(base) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_CIP1_SHIFT))
/*@}*/

/*!
 * @name Register ADC_STAT, field CIP0[15] (RO)
 *
 * This bit indicates whether a scan is in progress. This refers to any scan
 * except a B converter scan in non-simultaneous parallel scan modes.
 *
 * Values:
 * - 0 - Idle state
 * - 1 - A scan cycle is in progress. The ADC will ignore all sync pulses or
 *     start commands
 */
/*@{*/
/*! @brief Read current value of the ADC_STAT_CIP0 field. */
#define ADC_RD_STAT_CIP0(base) ((ADC_STAT_REG(base) & ADC_STAT_CIP0_MASK) >> ADC_STAT_CIP0_SHIFT)
#define ADC_BRD_STAT_CIP0(base) (BITBAND_ACCESS16(&ADC_STAT_REG(base), ADC_STAT_CIP0_SHIFT))
/*@}*/

