theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*! @brief Set the DIV1 field to a new value. */
#define ADC_WR_PWR2_DIV1(base, value) (ADC_RMW_PWR2(base, ADC_PWR2_DIV1_MASK, ADC_PWR2_DIV1(value)))
#define ADC_BWR_PWR2_DIV1(base, value) (ADC_WR_PWR2_DIV1(base, value))
/*@}*/

/*******************************************************************************
 * ADC_CTRL3 - ADC Control Register 3
 ******************************************************************************/

/*!
 * @brief ADC_CTRL3 - ADC Control Register 3 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire ADC_CTRL3 register
 */
/*@{*/
#define ADC_RD_CTRL3(base)       (ADC_CTRL3_REG(base))
#define ADC_WR_CTRL3(base, value) (ADC_CTRL3_REG(base) = (value))
#define ADC_RMW_CTRL3(base, mask, value) (ADC_WR_CTRL3(base, (ADC_RD_CTRL3(base) & ~(mask)) | (value)))
#define ADC_SET_CTRL3(base, value) (ADC_WR_CTRL3(base, ADC_RD_CTRL3(base) |  (value)))
#define ADC_CLR_CTRL3(base, value) (ADC_WR_CTRL3(base, ADC_RD_CTRL3(base) & ~(value)))
#define ADC_TOG_CTRL3(base, value) (ADC_WR_CTRL3(base, ADC_RD_CTRL3(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual ADC_CTRL3 bitfields
 */

/*!
 * @name Register ADC_CTRL3, field SCNT0[2:0] (RW)
 *
 * During sequential and parallel simultaneous scan modes (CTRL2[SIMULT]=1) the
 * CTRL3[SCNT0] bits control the sampling time of the first sample after a scan
 * is initiated on both converters A and B. In parallel non-simultaneous mode
 * (CTRL2[SIMULT]=0) CTRL3[SCNT0] affects converter A only. The default value is 0
 * which corresponds to a sampling time of 2 ADC clocks. Each increment of
 * CTRL3[SCNT0] corresponds to an additional ADC clock cycle of sampling time with a
 * maximum sampling time of 9 ADC clocks. In sequential scan mode the CTRL[SCNT0]
 * setting will be ignored whenever the channel selected for the next sample is on
 * the other converter. In other words, during a sequential scan, if a sample
 * converts a converter A channel (ANA0-ANA7) and the next sample converts a
 * converter B channel (ANB0-ANB7) or vice versa, CTRL3[SCNT0] will be ignored and use
 * the default sampling time for the next sample.
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL3_SCNT0 field. */
#define ADC_RD_CTRL3_SCNT0(base) ((ADC_CTRL3_REG(base) & ADC_CTRL3_SCNT0_MASK) >> ADC_CTRL3_SCNT0_SHIFT)
#define ADC_BRD_CTRL3_SCNT0(base) (ADC_RD_CTRL3_SCNT0(base))

/*! @brief Set the SCNT0 field to a new value. */
#define ADC_WR_CTRL3_SCNT0(base, value) (ADC_RMW_CTRL3(base, ADC_CTRL3_SCNT0_MASK, ADC_CTRL3_SCNT0(value)))
#define ADC_BWR_CTRL3_SCNT0(base, value) (ADC_WR_CTRL3_SCNT0(base, value))
/*@}*/

/*!
 * @name Register ADC_CTRL3, field SCNT1[5:3] (RW)
 *
 * During parallel non-simultaneous scan mode (CTRL2[SIMULT]=0) the CTRL3[SCNT1]
 * bits are used to control the sampling time of the first sample after a scan
 * is initiated on converter B. During sequential and parallel simultaneous scan
 * modes, CTRL3[SCNT1] is ignored and the sampling window for converters A and B
 * is controlled by CTRL3[SCNT0]. The default value is 0 which corresponds to a
 * sampling time of 2 ADC clocks. Each increment of CTRL3[SCNT1] corresponds to an
 * additional ADC clock cycle of sampling time with a maximum sampling time of 9
 * ADC clocks.
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL3_SCNT1 field. */
#define ADC_RD_CTRL3_SCNT1(base) ((ADC_CTRL3_REG(base) & ADC_CTRL3_SCNT1_MASK) >> ADC_CTRL3_SCNT1_SHIFT)
#define ADC_BRD_CTRL3_SCNT1(base) (ADC_RD_CTRL3_SCNT1(base))

/*! @brief Set the SCNT1 field to a new value. */
#define ADC_WR_CTRL3_SCNT1(base, value) (ADC_RMW_CTRL3(base, ADC_CTRL3_SCNT1_MASK, ADC_CTRL3_SCNT1(value)))
#define ADC_BWR_CTRL3_SCNT1(base, value) (ADC_WR_CTRL3_SCNT1(base, value))
/*@}*/

/*!
 * @name Register ADC_CTRL3, field DMASRC[6] (RW)
 *
 * During sequential and simultaneous parallel scan modes CTRL3[DMASRC] selects
 * between EOSI0 and RDY bits as the DMA source. During non-simultaneous parallel
 * scan mode CTRL3[DMASRC] selects between EOSI0/EOSI1 for converters A and B,
 * and the RDY bits as the DMA source.
 *
 * Values:
 * - 0 - DMA trigger source is end of scan interrupt
 * - 1 - DMA trigger source is RDY bits
 */
/*@{*/
/*! @brief Read current value of the ADC_CTRL3_DMASRC field. */
#define ADC_RD_CTRL3_DMASRC(base) ((ADC_CTRL3_REG(base) & ADC_CTRL3_DMASRC_MASK) >> ADC_CTRL3_DMASRC_SHIFT)
#define ADC_BRD_CTRL3_DMASRC(base) (BITBAND_ACCESS16(&ADC_CTRL3_REG(base), ADC_CTRL3_DMASRC_SHIFT))

/*! @brief Set the DMASRC field to a new value. */
#define ADC_WR_CTRL3_DMASRC(base, value) (ADC_RMW_CTRL3(base, ADC_CTRL3_DMASRC_MASK, ADC_CTRL3_DMASRC(value)))
#define ADC_BWR_CTRL3_DMASRC(base, value) (BITBAND_ACCESS16(&ADC_CTRL3_REG(base), ADC_CTRL3_DMASRC_SHIFT) = (value))
/*@}*/

/*******************************************************************************
 * ADC_SCHLTEN - ADC Scan Interrupt Enable Register
 ******************************************************************************/

/*!
 * @brief ADC_SCHLTEN - ADC Scan Interrupt Enable Register (RW)
 *
 * Reset value: 0x0000U
 *
 * This register is used with ready register (RDY) to select the samples that
 * will generate a scan interrupt.
 */
/*!
 * @name Constants and macros for entire ADC_SCHLTEN register
 */
/*@{*/
#define ADC_RD_SCHLTEN(base)     (ADC_SCHLTEN_REG(base))
#define ADC_WR_SCHLTEN(base, value) (ADC_SCHLTEN_REG(base) = (value))
#define ADC_RMW_SCHLTEN(base, mask, value) (ADC_WR_SCHLTEN(base, (ADC_RD_SCHLTEN(base) & ~(mask)) | (value)))
#define ADC_SET_SCHLTEN(base, value) (ADC_WR_SCHLTEN(base, ADC_RD_SCHLTEN(base) |  (value)))
#define ADC_CLR_SCHLTEN(base, value) (ADC_WR_SCHLTEN(base, ADC_RD_SCHLTEN(base) & ~(value)))
#define ADC_TOG_SCHLTEN(base, value) (ADC_WR_SCHLTEN(base, ADC_RD_SCHLTEN(base) ^  (value)))
/*@}*/

/*
 * MKV44F15 AIPS
 *
 * AIPS-Lite Bridge
 *
 * Registers defined in this header file:
 * - AIPS_MPRA - Master Privilege Register A
 * - AIPS_PACRA - Peripheral Access Control Register
 * - AIPS_PACRB - Peripheral Access Control Register
 * - AIPS_PACRC - Peripheral Access Control Register
 * - AIPS_PACRD - Peripheral Access Control Register
 * - AIPS_PACRE - Peripheral Access Control Register
 * - AIPS_PACRF - Peripheral Access Control Register
 * - AIPS_PACRG - Peripheral Access Control Register
 * - AIPS_PACRH - Peripheral Access Control Register
 * - AIPS_PACRI - Peripheral Access Control Register
 * - AIPS_PACRJ - Peripheral Access Control Register
 * - AIPS_PACRK - Peripheral Access Control Register
 * - AIPS_PACRL - Peripheral Access Control Register
 * - AIPS_PACRM - Peripheral Access Control Register
 * - AIPS_PACRN - Peripheral Access Control Register
 * - AIPS_PACRO - Peripheral Access Control Register
 * - AIPS_PACRP - Peripheral Access Control Register
 */

#define AIPS_INSTANCE_COUNT (1U) /*!< Number of instances of the AIPS module. */
#define AIPS_IDX (0U) /*!< Instance number for AIPS. */

