theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*
 * MKV44F15 PWM
 *
 * Pulse Width Modulator with nano edge placement
 *
 * Registers defined in this header file:
 * - PWM_CNT - Counter Register
 * - PWM_INIT - Initial Count Register
 * - PWM_CTRL2 - Control 2 Register
 * - PWM_CTRL - Control Register
 * - PWM_VAL0 - Value Register 0
 * - PWM_FRACVAL1 - Fractional Value Register 1
 * - PWM_VAL1 - Value Register 1
 * - PWM_FRACVAL2 - Fractional Value Register 2
 * - PWM_VAL2 - Value Register 2
 * - PWM_FRACVAL3 - Fractional Value Register 3
 * - PWM_VAL3 - Value Register 3
 * - PWM_FRACVAL4 - Fractional Value Register 4
 * - PWM_VAL4 - Value Register 4
 * - PWM_FRACVAL5 - Fractional Value Register 5
 * - PWM_VAL5 - Value Register 5
 * - PWM_FRCTRL - Fractional Control Register
 * - PWM_OCTRL - Output Control Register
 * - PWM_STS - Status Register
 * - PWM_INTEN - Interrupt Enable Register
 * - PWM_DMAEN - DMA Enable Register
 * - PWM_TCTRL - Output Trigger Control Register
 * - PWM_DISMAP - Fault Disable Mapping Register 0
 * - PWM_DTCNT0 - Deadtime Count Register 0
 * - PWM_DTCNT1 - Deadtime Count Register 1
 * - PWM_CAPTCTRLA - Capture Control A Register
 * - PWM_CAPTCOMPA - Capture Compare A Register
 * - PWM_CAPTCTRLB - Capture Control B Register
 * - PWM_CAPTCOMPB - Capture Compare B Register
 * - PWM_CAPTCTRLX - Capture Control X Register
 * - PWM_CAPTCOMPX - Capture Compare X Register
 * - PWM_CVAL0 - Capture Value 0 Register
 * - PWM_CVAL0CYC - Capture Value 0 Cycle Register
 * - PWM_CVAL1 - Capture Value 1 Register
 * - PWM_CVAL1CYC - Capture Value 1 Cycle Register
 * - PWM_CVAL2 - Capture Value 2 Register
 * - PWM_CVAL2CYC - Capture Value 2 Cycle Register
 * - PWM_CVAL3 - Capture Value 3 Register
 * - PWM_CVAL3CYC - Capture Value 3 Cycle Register
 * - PWM_CVAL4 - Capture Value 4 Register
 * - PWM_CVAL4CYC - Capture Value 4 Cycle Register
 * - PWM_CVAL5 - Capture Value 5 Register
 * - PWM_CVAL5CYC - Capture Value 5 Cycle Register
 * - PWM_OUTEN - Output Enable Register
 * - PWM_MASK - Mask Register
 * - PWM_SWCOUT - Software Controlled Output Register
 * - PWM_DTSRCSEL - PWM Source Select Register
 * - PWM_MCTRL - Master Control Register
 * - PWM_MCTRL2 - Master Control 2 Register
 * - PWM_FCTRL - Fault Control Register
 * - PWM_FSTS - Fault Status Register
 * - PWM_FFILT - Fault Filter Register
 * - PWM_FTST - Fault Test Register
 * - PWM_FCTRL2 - Fault Control 2 Register
 */

#define PWM_INSTANCE_COUNT (1U) /*!< Number of instances of the PWM module. */
#define PWMA_IDX (0U) /*!< Instance number for PWMA. */

/*******************************************************************************
 * PWM_CNT - Counter Register
 ******************************************************************************/

/*!
 * @brief PWM_CNT - Counter Register (RO)
 *
 * Reset value: 0x0000U
 *
 * This read-only register displays the state of the signed 16-bit submodule
 * counter. This register is not byte accessible.
 */
/*!
 * @name Constants and macros for entire PWM_CNT register
 */
/*@{*/
#define PWM_RD_CNT(base, index)  (PWM_CNT_REG(base, index))
/*@}*/

/*******************************************************************************
 * PWM_INIT - Initial Count Register
 ******************************************************************************/

/*!
 * @brief PWM_INIT - Initial Count Register (RW)
 *
 * Reset value: 0x0000U
 *
 * The 16-bit signed value in this buffered, read/write register defines the
 * initial count value for the PWM in PWM clock periods. This is the value loaded
 * into the submodule counter when local sync, master sync, or master reload is
 * asserted (based on the value of CTRL2[INIT_SEL]) or when CTRL2[FORCE] is asserted
 * and force init is enabled. For PWM operation, the buffered contents of this
 * register are loaded into the counter at the start of every PWM cycle. This
 * register is not byte accessible. The INIT register is buffered. The value written
 * does not take effect until MCTRL[LDOK] is set and the next PWM load cycle
 * begins or CTRL[LDMOD] is set. This register cannot be written when MCTRL[LDOK] is
 * set. Reading INIT reads the value in a buffer and not necessarily the value
 * the PWM generator is currently using.
 */
/*!
 * @name Constants and macros for entire PWM_INIT register
 */
/*@{*/
#define PWM_RD_INIT(base, index) (PWM_INIT_REG(base, index))
#define PWM_WR_INIT(base, index, value) (PWM_INIT_REG(base, index) = (value))
#define PWM_RMW_INIT(base, index, mask, value) (PWM_WR_INIT(base, index, (PWM_RD_INIT(base, index) & ~(mask)) | (value)))
#define PWM_SET_INIT(base, index, value) (PWM_WR_INIT(base, index, PWM_RD_INIT(base, index) |  (value)))
#define PWM_CLR_INIT(base, index, value) (PWM_WR_INIT(base, index, PWM_RD_INIT(base, index) & ~(value)))
#define PWM_TOG_INIT(base, index, value) (PWM_WR_INIT(base, index, PWM_RD_INIT(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * PWM_CTRL2 - Control 2 Register
 ******************************************************************************/

/*!
 * @brief PWM_CTRL2 - Control 2 Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CTRL2 register
 */
/*@{*/
#define PWM_RD_CTRL2(base, index) (PWM_CTRL2_REG(base, index))
#define PWM_WR_CTRL2(base, index, value) (PWM_CTRL2_REG(base, index) = (value))
#define PWM_RMW_CTRL2(base, index, mask, value) (PWM_WR_CTRL2(base, index, (PWM_RD_CTRL2(base, index) & ~(mask)) | (value)))
#define PWM_SET_CTRL2(base, index, value) (PWM_WR_CTRL2(base, index, PWM_RD_CTRL2(base, index) |  (value)))
#define PWM_CLR_CTRL2(base, index, value) (PWM_WR_CTRL2(base, index, PWM_RD_CTRL2(base, index) & ~(value)))
#define PWM_TOG_CTRL2(base, index, value) (PWM_WR_CTRL2(base, index, PWM_RD_CTRL2(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CTRL2 bitfields
 */

/*!
 * @name Register PWM_CTRL2, field CLK_SEL[1:0] (RW)
 *
 * These read/write bits determine the source of the clock signal for this
 * submodule.
 *
 * Values:
 * - 00 - The IPBus clock is used as the clock for the local prescaler and
 *     counter.
 * - 01 - EXT_CLK is used as the clock for the local prescaler and counter.
 * - 10 - Submodule 0's clock (AUX_CLK) is used as the source clock for the
 *     local prescaler and counter. This setting should not be used in submodule 0 as
 *     it will force the clock to logic 0.
 * - 11 - reserved
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_CLK_SEL field. */
#define PWM_RD_CTRL2_CLK_SEL(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_CLK_SEL_MASK) >> PWM_CTRL2_CLK_SEL_SHIFT)
#define PWM_BRD_CTRL2_CLK_SEL(base, index) (PWM_RD_CTRL2_CLK_SEL(base, index))

/*! @brief Set the CLK_SEL field to a new value. */
#define PWM_WR_CTRL2_CLK_SEL(base, index, value) (PWM_RMW_CTRL2(base, index, PWM_CTRL2_CLK_SEL_MASK, PWM_CTRL2_CLK_SEL(value)))
#define PWM_BWR_CTRL2_CLK_SEL(base, index, value) (PWM_WR_CTRL2_CLK_SEL(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CTRL2, field RELOAD_SEL[2] (RW)
 *
 * This read/write bit determines the source of the RELOAD signal for this
 * submodule. When this bit is set, MCTRL[LDOK[0]] for submodule 0 should be used
 * since the local MCTRL[LDOK] will be ignored.
 *
 * Values:
 * - 0 - The local RELOAD signal is used to reload registers.
 * - 1 - The master RELOAD signal (from submodule 0) is used to reload
 *     registers. This setting should not be used in submodule 0 as it will force the
 *     RELOAD signal to logic 0.
 */
/*@{*/
/*! @brief Read current value of the PWM_CTRL2_RELOAD_SEL field. */
#define PWM_RD_CTRL2_RELOAD_SEL(base, index) ((PWM_CTRL2_REG(base, index) & PWM_CTRL2_RELOAD_SEL_MASK) >> PWM_CTRL2_RELOAD_SEL_SHIFT)
#define PWM_BRD_CTRL2_RELOAD_SEL(base, index) (BITBAND_ACCESS16(&PWM_CTRL2_REG(base, index), PWM_CTRL2_RELOAD_SEL_SHIFT))

