theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*! @brief Set the LDFQ field to a new value. */
#define PWM_WR_CTRL_LDFQ(base, index, value) (PWM_RMW_CTRL(base, index, PWM_CTRL_LDFQ_MASK, PWM_CTRL_LDFQ(value)))
#define PWM_BWR_CTRL_LDFQ(base, index, value) (PWM_WR_CTRL_LDFQ(base, index, value))
/*@}*/

/*******************************************************************************
 * PWM_VAL0 - Value Register 0
 ******************************************************************************/

/*!
 * @brief PWM_VAL0 - Value Register 0 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL0 register
 */
/*@{*/
#define PWM_RD_VAL0(base, index) (PWM_VAL0_REG(base, index))
#define PWM_WR_VAL0(base, index, value) (PWM_VAL0_REG(base, index) = (value))
#define PWM_RMW_VAL0(base, index, mask, value) (PWM_WR_VAL0(base, index, (PWM_RD_VAL0(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL0(base, index, value) (PWM_WR_VAL0(base, index, PWM_RD_VAL0(base, index) |  (value)))
#define PWM_CLR_VAL0(base, index, value) (PWM_WR_VAL0(base, index, PWM_RD_VAL0(base, index) & ~(value)))
#define PWM_TOG_VAL0(base, index, value) (PWM_WR_VAL0(base, index, PWM_RD_VAL0(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL1 - Fractional Value Register 1
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL1 - Fractional Value Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL1 register
 */
/*@{*/
#define PWM_RD_FRACVAL1(base, index) (PWM_FRACVAL1_REG(base, index))
#define PWM_WR_FRACVAL1(base, index, value) (PWM_FRACVAL1_REG(base, index) = (value))
#define PWM_RMW_FRACVAL1(base, index, mask, value) (PWM_WR_FRACVAL1(base, index, (PWM_RD_FRACVAL1(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL1(base, index, value) (PWM_WR_FRACVAL1(base, index, PWM_RD_FRACVAL1(base, index) |  (value)))
#define PWM_CLR_FRACVAL1(base, index, value) (PWM_WR_FRACVAL1(base, index, PWM_RD_FRACVAL1(base, index) & ~(value)))
#define PWM_TOG_FRACVAL1(base, index, value) (PWM_WR_FRACVAL1(base, index, PWM_RD_FRACVAL1(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL1 bitfields
 */

/*!
 * @name Register PWM_FRACVAL1, field FRACVAL1[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL1 register
 * which controls the PWM period width. The PWM period is computed in terms of IPBus
 * clock cycles. This fractional portion is accumulated at the end of every
 * cycle until an additional whole IPBus cycle is reached. At this time the value
 * being used for VAL1 is temporarily incremented and the PWM cycle is extended by
 * one clock period to compensate for the accumulated fractional values. The
 * FRACVAL1 register is buffered. The value written does not take effect until
 * MCTRL[LDOK] is set and the next PWM load cycle begins or CTRL[LDMOD] is set. FRACVAL1
 * cannot be written when MCTRL[LDOK] is set. Reading FRACVAL1 reads the value
 * in a buffer and not necessarily the value the PWM generator is currently using.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL1_FRACVAL1 field. */
#define PWM_RD_FRACVAL1_FRACVAL1(base, index) ((PWM_FRACVAL1_REG(base, index) & PWM_FRACVAL1_FRACVAL1_MASK) >> PWM_FRACVAL1_FRACVAL1_SHIFT)
#define PWM_BRD_FRACVAL1_FRACVAL1(base, index) (PWM_RD_FRACVAL1_FRACVAL1(base, index))

/*! @brief Set the FRACVAL1 field to a new value. */
#define PWM_WR_FRACVAL1_FRACVAL1(base, index, value) (PWM_RMW_FRACVAL1(base, index, PWM_FRACVAL1_FRACVAL1_MASK, PWM_FRACVAL1_FRACVAL1(value)))
#define PWM_BWR_FRACVAL1_FRACVAL1(base, index, value) (PWM_WR_FRACVAL1_FRACVAL1(base, index, value))
/*@}*/

/*******************************************************************************
 * PWM_VAL1 - Value Register 1
 ******************************************************************************/

/*!
 * @brief PWM_VAL1 - Value Register 1 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_VAL1 register
 */
/*@{*/
#define PWM_RD_VAL1(base, index) (PWM_VAL1_REG(base, index))
#define PWM_WR_VAL1(base, index, value) (PWM_VAL1_REG(base, index) = (value))
#define PWM_RMW_VAL1(base, index, mask, value) (PWM_WR_VAL1(base, index, (PWM_RD_VAL1(base, index) & ~(mask)) | (value)))
#define PWM_SET_VAL1(base, index, value) (PWM_WR_VAL1(base, index, PWM_RD_VAL1(base, index) |  (value)))
#define PWM_CLR_VAL1(base, index, value) (PWM_WR_VAL1(base, index, PWM_RD_VAL1(base, index) & ~(value)))
#define PWM_TOG_VAL1(base, index, value) (PWM_WR_VAL1(base, index, PWM_RD_VAL1(base, index) ^  (value)))
/*@}*/

/*******************************************************************************
 * PWM_FRACVAL2 - Fractional Value Register 2
 ******************************************************************************/

/*!
 * @brief PWM_FRACVAL2 - Fractional Value Register 2 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_FRACVAL2 register
 */
/*@{*/
#define PWM_RD_FRACVAL2(base, index) (PWM_FRACVAL2_REG(base, index))
#define PWM_WR_FRACVAL2(base, index, value) (PWM_FRACVAL2_REG(base, index) = (value))
#define PWM_RMW_FRACVAL2(base, index, mask, value) (PWM_WR_FRACVAL2(base, index, (PWM_RD_FRACVAL2(base, index) & ~(mask)) | (value)))
#define PWM_SET_FRACVAL2(base, index, value) (PWM_WR_FRACVAL2(base, index, PWM_RD_FRACVAL2(base, index) |  (value)))
#define PWM_CLR_FRACVAL2(base, index, value) (PWM_WR_FRACVAL2(base, index, PWM_RD_FRACVAL2(base, index) & ~(value)))
#define PWM_TOG_FRACVAL2(base, index, value) (PWM_WR_FRACVAL2(base, index, PWM_RD_FRACVAL2(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_FRACVAL2 bitfields
 */

/*!
 * @name Register PWM_FRACVAL2, field FRACVAL2[15:11] (RW)
 *
 * These bits act as a fractional addition to the value in the VAL2 register
 * which controls the PWM_A turn on timing. It is also used to control the
 * fractional addition to the turn off delay of PWM_B when MCTRL[IPOLx]=0 in complementary
 * mode, CTRL2[INDEP]=0. The FRACVAL2 register is buffered. The value written
 * does not take effect until MCTRL[LDOK] is set and the next PWM load cycle begins
 * or CTRL[LDMOD] is set. FRACVAL2 cannot be written when MCTRL[LDOK] is set.
 * Reading FRACVAL2 reads the value in a buffer and not necessarily the value the
 * PWM generator is currently using. FRCTRL[FRAC23_EN] should be set to 0 when the
 * values of VAL2 and VAL3 cause the high or low time of the PWM output to be 3
 * cycles or less.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRACVAL2_FRACVAL2 field. */
#define PWM_RD_FRACVAL2_FRACVAL2(base, index) ((PWM_FRACVAL2_REG(base, index) & PWM_FRACVAL2_FRACVAL2_MASK) >> PWM_FRACVAL2_FRACVAL2_SHIFT)
#define PWM_BRD_FRACVAL2_FRACVAL2(base, index) (PWM_RD_FRACVAL2_FRACVAL2(base, index))

/*! @brief Set the FRACVAL2 field to a new value. */
#define PWM_WR_FRACVAL2_FRACVAL2(base, index, value) (PWM_RMW_FRACVAL2(base, index, PWM_FRACVAL2_FRACVAL2_MASK, PWM_FRACVAL2_FRACVAL2(value)))
#define PWM_BWR_FRACVAL2_FRACVAL2(base, index, value) (PWM_WR_FRACVAL2_FRACVAL2(base, index, value))
/*@}*/

