theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*! @brief Set the FRAC45_EN field to a new value. */
#define PWM_WR_FRCTRL_FRAC45_EN(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC45_EN_MASK, PWM_FRCTRL_FRAC45_EN(value)))
#define PWM_BWR_FRCTRL_FRAC45_EN(base, index, value) (BITBAND_ACCESS16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC45_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field FRAC_PU[8] (RW)
 *
 * This bit is used to power up the fractional delay analog block. The
 * fractional delay block takes 25 us to power up after the first FRAC_PU bit in any
 * submodule is set. The fractional delay block only powers down when the FRAC_PU bits
 * in all submodules are 0. The fractional delay logic can only be used when the
 * IPBus clock is running at 100 MHz. When turned off, fractional placement is
 * disabled.
 *
 * Values:
 * - 0 - Turn off fractional delay logic.
 * - 1 - Power up fractional delay logic.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_FRAC_PU field. */
#define PWM_RD_FRCTRL_FRAC_PU(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_FRAC_PU_MASK) >> PWM_FRCTRL_FRAC_PU_SHIFT)
#define PWM_BRD_FRCTRL_FRAC_PU(base, index) (BITBAND_ACCESS16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC_PU_SHIFT))

/*! @brief Set the FRAC_PU field to a new value. */
#define PWM_WR_FRCTRL_FRAC_PU(base, index, value) (PWM_RMW_FRCTRL(base, index, PWM_FRCTRL_FRAC_PU_MASK, PWM_FRCTRL_FRAC_PU(value)))
#define PWM_BWR_FRCTRL_FRAC_PU(base, index, value) (BITBAND_ACCESS16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_FRAC_PU_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_FRCTRL, field TEST[15] (RO)
 *
 * This is a read only test bit for factory use. This bit will reset to 0 but
 * may be either 0 or 1 during PWM operation.
 */
/*@{*/
/*! @brief Read current value of the PWM_FRCTRL_TEST field. */
#define PWM_RD_FRCTRL_TEST(base, index) ((PWM_FRCTRL_REG(base, index) & PWM_FRCTRL_TEST_MASK) >> PWM_FRCTRL_TEST_SHIFT)
#define PWM_BRD_FRCTRL_TEST(base, index) (BITBAND_ACCESS16(&PWM_FRCTRL_REG(base, index), PWM_FRCTRL_TEST_SHIFT))
/*@}*/

/*******************************************************************************
 * PWM_OCTRL - Output Control Register
 ******************************************************************************/

/*!
 * @brief PWM_OCTRL - Output Control Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_OCTRL register
 */
/*@{*/
#define PWM_RD_OCTRL(base, index) (PWM_OCTRL_REG(base, index))
#define PWM_WR_OCTRL(base, index, value) (PWM_OCTRL_REG(base, index) = (value))
#define PWM_RMW_OCTRL(base, index, mask, value) (PWM_WR_OCTRL(base, index, (PWM_RD_OCTRL(base, index) & ~(mask)) | (value)))
#define PWM_SET_OCTRL(base, index, value) (PWM_WR_OCTRL(base, index, PWM_RD_OCTRL(base, index) |  (value)))
#define PWM_CLR_OCTRL(base, index, value) (PWM_WR_OCTRL(base, index, PWM_RD_OCTRL(base, index) & ~(value)))
#define PWM_TOG_OCTRL(base, index, value) (PWM_WR_OCTRL(base, index, PWM_RD_OCTRL(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_OCTRL bitfields
 */

/*!
 * @name Register PWM_OCTRL, field PWMXFS[1:0] (RW)
 *
 * These bits determine the fault state for the PWM_X output during fault
 * conditions and STOP mode. It may also define the output state during WAIT and DEBUG
 * modes depending on the settings of CTRL2[WAITEN] and CTRL2[DBGEN].
 *
 * Values:
 * - 00 - Output is forced to logic 0 state prior to consideration of output
 *     polarity control.
 * - 01 - Output is forced to logic 1 state prior to consideration of output
 *     polarity control.
 * - 10 - Output is tristated.
 * - 11 - Output is tristated.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMXFS field. */
#define PWM_RD_OCTRL_PWMXFS(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMXFS_MASK) >> PWM_OCTRL_PWMXFS_SHIFT)
#define PWM_BRD_OCTRL_PWMXFS(base, index) (PWM_RD_OCTRL_PWMXFS(base, index))

/*! @brief Set the PWMXFS field to a new value. */
#define PWM_WR_OCTRL_PWMXFS(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_PWMXFS_MASK, PWM_OCTRL_PWMXFS(value)))
#define PWM_BWR_OCTRL_PWMXFS(base, index, value) (PWM_WR_OCTRL_PWMXFS(base, index, value))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMBFS[3:2] (RW)
 *
 * These bits determine the fault state for the PWM_B output during fault
 * conditions and STOP mode. It may also define the output state during WAIT and DEBUG
 * modes depending on the settings of CTRL2[WAITEN] and CTRL2[DBGEN].
 *
 * Values:
 * - 00 - Output is forced to logic 0 state prior to consideration of output
 *     polarity control.
 * - 01 - Output is forced to logic 1 state prior to consideration of output
 *     polarity control.
 * - 10 - Output is tristated.
 * - 11 - Output is tristated.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMBFS field. */
#define PWM_RD_OCTRL_PWMBFS(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMBFS_MASK) >> PWM_OCTRL_PWMBFS_SHIFT)
#define PWM_BRD_OCTRL_PWMBFS(base, index) (PWM_RD_OCTRL_PWMBFS(base, index))

/*! @brief Set the PWMBFS field to a new value. */
#define PWM_WR_OCTRL_PWMBFS(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_PWMBFS_MASK, PWM_OCTRL_PWMBFS(value)))
#define PWM_BWR_OCTRL_PWMBFS(base, index, value) (PWM_WR_OCTRL_PWMBFS(base, index, value))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMAFS[5:4] (RW)
 *
 * These bits determine the fault state for the PWM_A output during fault
 * conditions and STOP mode. It may also define the output state during WAIT and DEBUG
 * modes depending on the settings of CTRL2[WAITEN] and CTRL2[DBGEN].
 *
 * Values:
 * - 00 - Output is forced to logic 0 state prior to consideration of output
 *     polarity control.
 * - 01 - Output is forced to logic 1 state prior to consideration of output
 *     polarity control.
 * - 10 - Output is tristated.
 * - 11 - Output is tristated.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMAFS field. */
#define PWM_RD_OCTRL_PWMAFS(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMAFS_MASK) >> PWM_OCTRL_PWMAFS_SHIFT)
#define PWM_BRD_OCTRL_PWMAFS(base, index) (PWM_RD_OCTRL_PWMAFS(base, index))

/*! @brief Set the PWMAFS field to a new value. */
#define PWM_WR_OCTRL_PWMAFS(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_PWMAFS_MASK, PWM_OCTRL_PWMAFS(value)))
#define PWM_BWR_OCTRL_PWMAFS(base, index, value) (PWM_WR_OCTRL_PWMAFS(base, index, value))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field POLX[8] (RW)
 *
 * This bit inverts the PWM_X output polarity.
 *
 * Values:
 * - 0 - PWM_X output not inverted. A high level on the PWM_X pin represents the
 *     "on" or "active" state.
 * - 1 - PWM_X output inverted. A low level on the PWM_X pin represents the "on"
 *     or "active" state.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_POLX field. */
#define PWM_RD_OCTRL_POLX(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_POLX_MASK) >> PWM_OCTRL_POLX_SHIFT)
#define PWM_BRD_OCTRL_POLX(base, index) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLX_SHIFT))

/*! @brief Set the POLX field to a new value. */
#define PWM_WR_OCTRL_POLX(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_POLX_MASK, PWM_OCTRL_POLX(value)))
#define PWM_BWR_OCTRL_POLX(base, index, value) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLX_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field POLB[9] (RW)
 *
 * This bit inverts the PWM_B output polarity.
 *
 * Values:
 * - 0 - PWM_B output not inverted. A high level on the PWM_B pin represents the
 *     "on" or "active" state.
 * - 1 - PWM_B output inverted. A low level on the PWM_B pin represents the "on"
 *     or "active" state.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_POLB field. */
#define PWM_RD_OCTRL_POLB(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_POLB_MASK) >> PWM_OCTRL_POLB_SHIFT)
#define PWM_BRD_OCTRL_POLB(base, index) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLB_SHIFT))

/*! @brief Set the POLB field to a new value. */
#define PWM_WR_OCTRL_POLB(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_POLB_MASK, PWM_OCTRL_POLB(value)))
#define PWM_BWR_OCTRL_POLB(base, index, value) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLB_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field POLA[10] (RW)
 *
 * This bit inverts the PWM_A output polarity.
 *
 * Values:
 * - 0 - PWM_A output not inverted. A high level on the PWM_A pin represents the
 *     "on" or "active" state.
 * - 1 - PWM_A output inverted. A low level on the PWM_A pin represents the "on"
 *     or "active" state.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_POLA field. */
#define PWM_RD_OCTRL_POLA(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_POLA_MASK) >> PWM_OCTRL_POLA_SHIFT)
#define PWM_BRD_OCTRL_POLA(base, index) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLA_SHIFT))

/*! @brief Set the POLA field to a new value. */
#define PWM_WR_OCTRL_POLA(base, index, value) (PWM_RMW_OCTRL(base, index, PWM_OCTRL_POLA_MASK, PWM_OCTRL_POLA(value)))
#define PWM_BWR_OCTRL_POLA(base, index, value) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_POLA_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMX_IN[13] (RO)
 *
 * This read only bit shows the logic value currently being driven into the
 * PWM_X input. The bit's reset state is undefined.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMX_IN field. */
#define PWM_RD_OCTRL_PWMX_IN(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMX_IN_MASK) >> PWM_OCTRL_PWMX_IN_SHIFT)
#define PWM_BRD_OCTRL_PWMX_IN(base, index) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMX_IN_SHIFT))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMB_IN[14] (RO)
 *
 * This read only bit shows the logic value currently being driven into the
 * PWM_B input. The bit's reset state is undefined.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMB_IN field. */
#define PWM_RD_OCTRL_PWMB_IN(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMB_IN_MASK) >> PWM_OCTRL_PWMB_IN_SHIFT)
#define PWM_BRD_OCTRL_PWMB_IN(base, index) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMB_IN_SHIFT))
/*@}*/

/*!
 * @name Register PWM_OCTRL, field PWMA_IN[15] (RO)
 *
 * This read only bit shows the logic value currently being driven into the
 * PWM_A input. The bit's reset state is undefined.
 */
/*@{*/
/*! @brief Read current value of the PWM_OCTRL_PWMA_IN field. */
#define PWM_RD_OCTRL_PWMA_IN(base, index) ((PWM_OCTRL_REG(base, index) & PWM_OCTRL_PWMA_IN_MASK) >> PWM_OCTRL_PWMA_IN_SHIFT)
#define PWM_BRD_OCTRL_PWMA_IN(base, index) (BITBAND_ACCESS16(&PWM_OCTRL_REG(base, index), PWM_OCTRL_PWMA_IN_SHIFT))
/*@}*/

