theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*******************************************************************************
 * PWM_STS - Status Register
 ******************************************************************************/

/*!
 * @brief PWM_STS - Status Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_STS register
 */
/*@{*/
#define PWM_RD_STS(base, index)  (PWM_STS_REG(base, index))
#define PWM_WR_STS(base, index, value) (PWM_STS_REG(base, index) = (value))
#define PWM_RMW_STS(base, index, mask, value) (PWM_WR_STS(base, index, (PWM_RD_STS(base, index) & ~(mask)) | (value)))
#define PWM_SET_STS(base, index, value) (PWM_WR_STS(base, index, PWM_RD_STS(base, index) |  (value)))
#define PWM_CLR_STS(base, index, value) (PWM_WR_STS(base, index, PWM_RD_STS(base, index) & ~(value)))
#define PWM_TOG_STS(base, index, value) (PWM_WR_STS(base, index, PWM_RD_STS(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_STS bitfields
 */

/*!
 * @name Register PWM_STS, field CMPF[5:0] (W1C)
 *
 * These bits are set when the submodule counter value matches the value of one
 * of the VALx registers. Clear these bits by writing a 1 to a bit position.
 *
 * Values:
 * - 0 - No compare event has occurred for a particular VALx value.
 * - 1 - A compare event has occurred for a particular VALx value.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_CMPF field. */
#define PWM_RD_STS_CMPF(base, index) ((PWM_STS_REG(base, index) & PWM_STS_CMPF_MASK) >> PWM_STS_CMPF_SHIFT)
#define PWM_BRD_STS_CMPF(base, index) (PWM_RD_STS_CMPF(base, index))

/*! @brief Set the CMPF field to a new value. */
#define PWM_WR_STS_CMPF(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA0_MASK | PWM_STS_CFA1_MASK | PWM_STS_RF_MASK | PWM_STS_REF_MASK), PWM_STS_CMPF(value)))
#define PWM_BWR_STS_CMPF(base, index, value) (PWM_WR_STS_CMPF(base, index, value))
/*@}*/

/*!
 * @name Register PWM_STS, field CFX0[6] (W1C)
 *
 * This bit is set when a capture event occurs on the Capture X0 circuit. This
 * bit is cleared by writing a one to this bit position if DMAEN[CX0DE] is clear
 * (non-DMA mode) or by the DMA done signal if DMAEN[CX0DE] is set (DMA mode).
 * Reset clears this bit.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_CFX0 field. */
#define PWM_RD_STS_CFX0(base, index) ((PWM_STS_REG(base, index) & PWM_STS_CFX0_MASK) >> PWM_STS_CFX0_SHIFT)
#define PWM_BRD_STS_CFX0(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFX0_SHIFT))

/*! @brief Set the CFX0 field to a new value. */
#define PWM_WR_STS_CFX0(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_CFX0_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA0_MASK | PWM_STS_CFA1_MASK | PWM_STS_RF_MASK | PWM_STS_REF_MASK), PWM_STS_CFX0(value)))
#define PWM_BWR_STS_CFX0(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFX0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field CFX1[7] (W1C)
 *
 * This bit is set when a capture event occurs on the Capture X1 circuit. This
 * bit is cleared by writing a one to this bit position if DMAEN[CX1DE] is clear
 * (non-DMA mode) or by the DMA done signal if DMAEN[CX1DE] is set (DMA mode).
 * Reset clears this bit.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_CFX1 field. */
#define PWM_RD_STS_CFX1(base, index) ((PWM_STS_REG(base, index) & PWM_STS_CFX1_MASK) >> PWM_STS_CFX1_SHIFT)
#define PWM_BRD_STS_CFX1(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFX1_SHIFT))

/*! @brief Set the CFX1 field to a new value. */
#define PWM_WR_STS_CFX1(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_CFX1_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA0_MASK | PWM_STS_CFA1_MASK | PWM_STS_RF_MASK | PWM_STS_REF_MASK), PWM_STS_CFX1(value)))
#define PWM_BWR_STS_CFX1(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFX1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field CFB0[8] (W1C)
 *
 * This bit is set when a capture event occurs on the Capture B0 circuit. This
 * bit is cleared by writing a one to this bit position if DMAEN[CB0DE] is clear
 * (non-DMA mode) or by the DMA done signal if DMAEN[CB0DE] is set (DMA mode).
 * Reset clears this bit.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_CFB0 field. */
#define PWM_RD_STS_CFB0(base, index) ((PWM_STS_REG(base, index) & PWM_STS_CFB0_MASK) >> PWM_STS_CFB0_SHIFT)
#define PWM_BRD_STS_CFB0(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFB0_SHIFT))

/*! @brief Set the CFB0 field to a new value. */
#define PWM_WR_STS_CFB0(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_CFB0_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA0_MASK | PWM_STS_CFA1_MASK | PWM_STS_RF_MASK | PWM_STS_REF_MASK), PWM_STS_CFB0(value)))
#define PWM_BWR_STS_CFB0(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFB0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field CFB1[9] (W1C)
 *
 * This bit is set when a capture event occurs on the Capture B1 circuit. This
 * bit is cleared by writing a one to this bit position if DMAEN[CB1DE] is clear
 * (non-DMA mode) or by the DMA done signal if DMAEN[CB1DE] is set (DMA mode).
 * Reset clears this bit.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_CFB1 field. */
#define PWM_RD_STS_CFB1(base, index) ((PWM_STS_REG(base, index) & PWM_STS_CFB1_MASK) >> PWM_STS_CFB1_SHIFT)
#define PWM_BRD_STS_CFB1(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFB1_SHIFT))

/*! @brief Set the CFB1 field to a new value. */
#define PWM_WR_STS_CFB1(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_CFB1_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFA0_MASK | PWM_STS_CFA1_MASK | PWM_STS_RF_MASK | PWM_STS_REF_MASK), PWM_STS_CFB1(value)))
#define PWM_BWR_STS_CFB1(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFB1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field CFA0[10] (W1C)
 *
 * This bit is set when a capture event occurs on the Capture A0 circuit. This
 * bit is cleared by writing a one to this bit position if DMAEN[CA0DE] is clear
 * (non-DMA mode) or by the DMA done signal if DMAEN[CA0DE] is set (DMA mode).
 * Reset clears this bit.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_CFA0 field. */
#define PWM_RD_STS_CFA0(base, index) ((PWM_STS_REG(base, index) & PWM_STS_CFA0_MASK) >> PWM_STS_CFA0_SHIFT)
#define PWM_BRD_STS_CFA0(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFA0_SHIFT))

/*! @brief Set the CFA0 field to a new value. */
#define PWM_WR_STS_CFA0(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_CFA0_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA1_MASK | PWM_STS_RF_MASK | PWM_STS_REF_MASK), PWM_STS_CFA0(value)))
#define PWM_BWR_STS_CFA0(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFA0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field CFA1[11] (W1C)
 *
 * This bit is set when a capture event occurs on the Capture A1 circuit. This
 * bit is cleared by writing a one to this bit position if DMAEN[CA1DE] is clear
 * (non-DMA mode) or by the DMA done signal if DMAEN[CA1DE] is set (DMA mode).
 * Reset clears this bit.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_CFA1 field. */
#define PWM_RD_STS_CFA1(base, index) ((PWM_STS_REG(base, index) & PWM_STS_CFA1_MASK) >> PWM_STS_CFA1_SHIFT)
#define PWM_BRD_STS_CFA1(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFA1_SHIFT))

/*! @brief Set the CFA1 field to a new value. */
#define PWM_WR_STS_CFA1(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_CFA1_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA0_MASK | PWM_STS_RF_MASK | PWM_STS_REF_MASK), PWM_STS_CFA1(value)))
#define PWM_BWR_STS_CFA1(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_CFA1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field RF[12] (W1C)
 *
 * This read/write flag is set at the beginning of every reload cycle regardless
 * of the state of MCTRL[LDOK]. Clear this bit by writing a logic one to this
 * location when DMAEN[VALDE] is clear (non-DMA mode). This flag can also be
 * cleared by the DMA done signal when DMAEN[VALDE] is set (DMA mode). Reset clears
 * this bit.
 *
 * Values:
 * - 0 - No new reload cycle since last STS[RF] clearing
 * - 1 - New reload cycle since last STS[RF] clearing
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_RF field. */
#define PWM_RD_STS_RF(base, index) ((PWM_STS_REG(base, index) & PWM_STS_RF_MASK) >> PWM_STS_RF_SHIFT)
#define PWM_BRD_STS_RF(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_RF_SHIFT))

/*! @brief Set the RF field to a new value. */
#define PWM_WR_STS_RF(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_RF_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA0_MASK | PWM_STS_CFA1_MASK | PWM_STS_REF_MASK), PWM_STS_RF(value)))
#define PWM_BWR_STS_RF(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_RF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field REF[13] (W1C)
 *
 * This read/write flag is set when a reload cycle occurs while MCTRL[LDOK] is 0
 * and the double buffered registers are in a non-coherent state (STS[RUF] = 1).
 * Clear this bit by writing a logic one to this location. Reset clears this bit.
 *
 * Values:
 * - 0 - No reload error occurred.
 * - 1 - Reload signal occurred with non-coherent data and MCTRL[LDOK] = 0.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_REF field. */
#define PWM_RD_STS_REF(base, index) ((PWM_STS_REG(base, index) & PWM_STS_REF_MASK) >> PWM_STS_REF_SHIFT)
#define PWM_BRD_STS_REF(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_REF_SHIFT))

/*! @brief Set the REF field to a new value. */
#define PWM_WR_STS_REF(base, index, value) (PWM_RMW_STS(base, index, (PWM_STS_REF_MASK | PWM_STS_CMPF_MASK | PWM_STS_CFX0_MASK | PWM_STS_CFX1_MASK | PWM_STS_CFB0_MASK | PWM_STS_CFB1_MASK | PWM_STS_CFA0_MASK | PWM_STS_CFA1_MASK | PWM_STS_RF_MASK), PWM_STS_REF(value)))
#define PWM_BWR_STS_REF(base, index, value) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_REF_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_STS, field RUF[14] (RO)
 *
 * This read-only flag is set when one of the INIT, VALx,FRACVALx, or CTRL[PRSC]
 * registers has been written, which indicates potentially non-coherent data in
 * the set of double buffered registers. Clear this bit by a proper reload
 * sequence consisting of a reload signal while MCTRL[LDOK] = 1. Reset clears this bit.
 *
 * Values:
 * - 0 - No register update has occurred since last reload.
 * - 1 - At least one of the double buffered registers has been updated since
 *     the last reload.
 */
/*@{*/
/*! @brief Read current value of the PWM_STS_RUF field. */
#define PWM_RD_STS_RUF(base, index) ((PWM_STS_REG(base, index) & PWM_STS_RUF_MASK) >> PWM_STS_RUF_SHIFT)
#define PWM_BRD_STS_RUF(base, index) (BITBAND_ACCESS16(&PWM_STS_REG(base, index), PWM_STS_RUF_SHIFT))
/*@}*/

