theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*! @brief Set the EDGCNTB_EN field to a new value. */
#define PWM_WR_CAPTCTRLB_EDGCNTB_EN(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_EDGCNTB_EN_MASK, PWM_CAPTCTRLB_EDGCNTB_EN(value)))
#define PWM_BWR_CAPTCTRLB_EDGCNTB_EN(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLB_REG(base, index), PWM_CAPTCTRLB_EDGCNTB_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field CFBWM[9:8] (RW)
 *
 * This field represents the water mark level for capture B FIFOs. The capture
 * flags, STS[CFB1] and STS[CFB0], won't be set until the word count of the
 * corresponding FIFO is greater than this water mark level. (FIFO depth is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_CFBWM field. */
#define PWM_RD_CAPTCTRLB_CFBWM(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_CFBWM_MASK) >> PWM_CAPTCTRLB_CFBWM_SHIFT)
#define PWM_BRD_CAPTCTRLB_CFBWM(base, index) (PWM_RD_CAPTCTRLB_CFBWM(base, index))

/*! @brief Set the CFBWM field to a new value. */
#define PWM_WR_CAPTCTRLB_CFBWM(base, index, value) (PWM_RMW_CAPTCTRLB(base, index, PWM_CAPTCTRLB_CFBWM_MASK, PWM_CAPTCTRLB_CFBWM(value)))
#define PWM_BWR_CAPTCTRLB_CFBWM(base, index, value) (PWM_WR_CAPTCTRLB_CFBWM(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field CB0CNT[12:10] (RO)
 *
 * This field reflects the number of words in the Capture B0 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_CB0CNT field. */
#define PWM_RD_CAPTCTRLB_CB0CNT(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_CB0CNT_MASK) >> PWM_CAPTCTRLB_CB0CNT_SHIFT)
#define PWM_BRD_CAPTCTRLB_CB0CNT(base, index) (PWM_RD_CAPTCTRLB_CB0CNT(base, index))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLB, field CB1CNT[15:13] (RO)
 *
 * This field reflects the number of words in the Capture B1 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLB_CB1CNT field. */
#define PWM_RD_CAPTCTRLB_CB1CNT(base, index) ((PWM_CAPTCTRLB_REG(base, index) & PWM_CAPTCTRLB_CB1CNT_MASK) >> PWM_CAPTCTRLB_CB1CNT_SHIFT)
#define PWM_BRD_CAPTCTRLB_CB1CNT(base, index) (PWM_RD_CAPTCTRLB_CB1CNT(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCOMPB - Capture Compare B Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCOMPB - Capture Compare B Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCOMPB register
 */
/*@{*/
#define PWM_RD_CAPTCOMPB(base, index) (PWM_CAPTCOMPB_REG(base, index))
#define PWM_WR_CAPTCOMPB(base, index, value) (PWM_CAPTCOMPB_REG(base, index) = (value))
#define PWM_RMW_CAPTCOMPB(base, index, mask, value) (PWM_WR_CAPTCOMPB(base, index, (PWM_RD_CAPTCOMPB(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCOMPB(base, index, value) (PWM_WR_CAPTCOMPB(base, index, PWM_RD_CAPTCOMPB(base, index) |  (value)))
#define PWM_CLR_CAPTCOMPB(base, index, value) (PWM_WR_CAPTCOMPB(base, index, PWM_RD_CAPTCOMPB(base, index) & ~(value)))
#define PWM_TOG_CAPTCOMPB(base, index, value) (PWM_WR_CAPTCOMPB(base, index, PWM_RD_CAPTCOMPB(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCOMPB bitfields
 */

/*!
 * @name Register PWM_CAPTCOMPB, field EDGCMPB[7:0] (RW)
 *
 * This read/write field is the compare value associated with the edge counter
 * for the PWM_B input capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPB_EDGCMPB field. */
#define PWM_RD_CAPTCOMPB_EDGCMPB(base, index) ((PWM_CAPTCOMPB_REG(base, index) & PWM_CAPTCOMPB_EDGCMPB_MASK) >> PWM_CAPTCOMPB_EDGCMPB_SHIFT)
#define PWM_BRD_CAPTCOMPB_EDGCMPB(base, index) (PWM_RD_CAPTCOMPB_EDGCMPB(base, index))

/*! @brief Set the EDGCMPB field to a new value. */
#define PWM_WR_CAPTCOMPB_EDGCMPB(base, index, value) (PWM_RMW_CAPTCOMPB(base, index, PWM_CAPTCOMPB_EDGCMPB_MASK, PWM_CAPTCOMPB_EDGCMPB(value)))
#define PWM_BWR_CAPTCOMPB_EDGCMPB(base, index, value) (PWM_WR_CAPTCOMPB_EDGCMPB(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCOMPB, field EDGCNTB[15:8] (RO)
 *
 * This read-only field contains the edge counter value for the PWM_B input
 * capture circuitry.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCOMPB_EDGCNTB field. */
#define PWM_RD_CAPTCOMPB_EDGCNTB(base, index) ((PWM_CAPTCOMPB_REG(base, index) & PWM_CAPTCOMPB_EDGCNTB_MASK) >> PWM_CAPTCOMPB_EDGCNTB_SHIFT)
#define PWM_BRD_CAPTCOMPB_EDGCNTB(base, index) (PWM_RD_CAPTCOMPB_EDGCNTB(base, index))
/*@}*/

/*******************************************************************************
 * PWM_CAPTCTRLX - Capture Control X Register
 ******************************************************************************/

/*!
 * @brief PWM_CAPTCTRLX - Capture Control X Register (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire PWM_CAPTCTRLX register
 */
/*@{*/
#define PWM_RD_CAPTCTRLX(base, index) (PWM_CAPTCTRLX_REG(base, index))
#define PWM_WR_CAPTCTRLX(base, index, value) (PWM_CAPTCTRLX_REG(base, index) = (value))
#define PWM_RMW_CAPTCTRLX(base, index, mask, value) (PWM_WR_CAPTCTRLX(base, index, (PWM_RD_CAPTCTRLX(base, index) & ~(mask)) | (value)))
#define PWM_SET_CAPTCTRLX(base, index, value) (PWM_WR_CAPTCTRLX(base, index, PWM_RD_CAPTCTRLX(base, index) |  (value)))
#define PWM_CLR_CAPTCTRLX(base, index, value) (PWM_WR_CAPTCTRLX(base, index, PWM_RD_CAPTCTRLX(base, index) & ~(value)))
#define PWM_TOG_CAPTCTRLX(base, index, value) (PWM_WR_CAPTCTRLX(base, index, PWM_RD_CAPTCTRLX(base, index) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual PWM_CAPTCTRLX bitfields
 */

/*!
 * @name Register PWM_CAPTCTRLX, field ARMX[0] (RW)
 *
 * Setting this bit high starts the input capture process. This bit can be
 * cleared at any time to disable input capture operation. This bit is self-cleared
 * when in one shot mode and one or more of the enabled capture circuits has had a
 * capture event.
 *
 * Values:
 * - 0 - Input capture operation is disabled.
 * - 1 - Input capture operation as specified by CAPTCTRLX[EDGXx] is enabled.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_ARMX field. */
#define PWM_RD_CAPTCTRLX_ARMX(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_ARMX_MASK) >> PWM_CAPTCTRLX_ARMX_SHIFT)
#define PWM_BRD_CAPTCTRLX_ARMX(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_ARMX_SHIFT))

/*! @brief Set the ARMX field to a new value. */
#define PWM_WR_CAPTCTRLX_ARMX(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_ARMX_MASK, PWM_CAPTCTRLX_ARMX(value)))
#define PWM_BWR_CAPTCTRLX_ARMX(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_ARMX_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field ONESHOTX[1] (RW)
 *
 * This bit selects between free running and one shot mode for the input capture
 * circuitry.
 *
 * Values:
 * - 0 - Free running mode is selected. If both capture circuits are enabled,
 *     then capture circuit 0 is armed first after the ARMX bit is set. Once a
 *     capture occurs, capture circuit 0 is disarmed and capture circuit 1 is armed.
 *     After capture circuit 1 performs a capture, it is disarmed and capture
 *     circuit 0 is re-armed. The process continues indefinitely. If only one of the
 *     capture circuits is enabled, then captures continue indefinitely on the
 *     enabled capture circuit.
 * - 1 - One shot mode is selected. If both capture circuits are enabled, then
 *     capture circuit 0 is armed first after the ARMX bit is set. Once a capture
 *     occurs, capture circuit 0 is disarmed and capture circuit 1 is armed.
 *     After capture circuit 1 performs a capture, it is disarmed and the ARMX bit is
 *     cleared. No further captures will be performed until the ARMX bit is set
 *     again. If only one of the capture circuits is enabled, then a single
 *     capture will occur on the enabled capture circuit and the ARMX bit is then
 *     cleared.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_ONESHOTX field. */
#define PWM_RD_CAPTCTRLX_ONESHOTX(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_ONESHOTX_MASK) >> PWM_CAPTCTRLX_ONESHOTX_SHIFT)
#define PWM_BRD_CAPTCTRLX_ONESHOTX(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_ONESHOTX_SHIFT))

