theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*! @brief Set the ONESHOTX field to a new value. */
#define PWM_WR_CAPTCTRLX_ONESHOTX(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_ONESHOTX_MASK, PWM_CAPTCTRLX_ONESHOTX(value)))
#define PWM_BWR_CAPTCTRLX_ONESHOTX(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_ONESHOTX_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field EDGX0[3:2] (RW)
 *
 * These bits control the input capture 0 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 00 - Disabled
 * - 01 - Capture falling edges
 * - 10 - Capture rising edges
 * - 11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_EDGX0 field. */
#define PWM_RD_CAPTCTRLX_EDGX0(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_EDGX0_MASK) >> PWM_CAPTCTRLX_EDGX0_SHIFT)
#define PWM_BRD_CAPTCTRLX_EDGX0(base, index) (PWM_RD_CAPTCTRLX_EDGX0(base, index))

/*! @brief Set the EDGX0 field to a new value. */
#define PWM_WR_CAPTCTRLX_EDGX0(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_EDGX0_MASK, PWM_CAPTCTRLX_EDGX0(value)))
#define PWM_BWR_CAPTCTRLX_EDGX0(base, index, value) (PWM_WR_CAPTCTRLX_EDGX0(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field EDGX1[5:4] (RW)
 *
 * These bits control the input capture 1 circuitry by determining which input
 * edges cause a capture event.
 *
 * Values:
 * - 00 - Disabled
 * - 01 - Capture falling edges
 * - 10 - Capture rising edges
 * - 11 - Capture any edge
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_EDGX1 field. */
#define PWM_RD_CAPTCTRLX_EDGX1(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_EDGX1_MASK) >> PWM_CAPTCTRLX_EDGX1_SHIFT)
#define PWM_BRD_CAPTCTRLX_EDGX1(base, index) (PWM_RD_CAPTCTRLX_EDGX1(base, index))

/*! @brief Set the EDGX1 field to a new value. */
#define PWM_WR_CAPTCTRLX_EDGX1(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_EDGX1_MASK, PWM_CAPTCTRLX_EDGX1(value)))
#define PWM_BWR_CAPTCTRLX_EDGX1(base, index, value) (PWM_WR_CAPTCTRLX_EDGX1(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field INP_SELX[6] (RW)
 *
 * This bit selects between the raw PWM_X input signal and the output of the
 * edge counter/compare circuitry as the source for the input capture circuit.
 *
 * Values:
 * - 0 - Raw PWM_X input signal selected as source.
 * - 1 - Output of edge counter/compare selected as source. When this bitfield
 *     is set to 1, the internal edge counter is enabled and the rising and/or
 *     falling edges specified by the CAPTCTRLX[EDGX0] and CAPTCTRLX[EDGX1] fields
 *     are ignored. The software must still place a value other than 00 in either
 *     or both of the CAPTCTLRX[EDGX0] and/or CAPTCTRLX[EDGX1] fields in order to
 *     enable one or both of the capture registers.
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_INP_SELX field. */
#define PWM_RD_CAPTCTRLX_INP_SELX(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_INP_SELX_MASK) >> PWM_CAPTCTRLX_INP_SELX_SHIFT)
#define PWM_BRD_CAPTCTRLX_INP_SELX(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_INP_SELX_SHIFT))

/*! @brief Set the INP_SELX field to a new value. */
#define PWM_WR_CAPTCTRLX_INP_SELX(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_INP_SELX_MASK, PWM_CAPTCTRLX_INP_SELX(value)))
#define PWM_BWR_CAPTCTRLX_INP_SELX(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_INP_SELX_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field EDGCNTX_EN[7] (RW)
 *
 * This bit enables the edge counter which counts rising and falling edges on
 * the PWM_X input signal.
 *
 * Values:
 * - 0 - Edge counter disabled and held in reset
 * - 1 - Edge counter enabled
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_EDGCNTX_EN field. */
#define PWM_RD_CAPTCTRLX_EDGCNTX_EN(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_EDGCNTX_EN_MASK) >> PWM_CAPTCTRLX_EDGCNTX_EN_SHIFT)
#define PWM_BRD_CAPTCTRLX_EDGCNTX_EN(base, index) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_EDGCNTX_EN_SHIFT))

/*! @brief Set the EDGCNTX_EN field to a new value. */
#define PWM_WR_CAPTCTRLX_EDGCNTX_EN(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_EDGCNTX_EN_MASK, PWM_CAPTCTRLX_EDGCNTX_EN(value)))
#define PWM_BWR_CAPTCTRLX_EDGCNTX_EN(base, index, value) (BITBAND_ACCESS16(&PWM_CAPTCTRLX_REG(base, index), PWM_CAPTCTRLX_EDGCNTX_EN_SHIFT) = (value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field CFXWM[9:8] (RW)
 *
 * This field represents the water mark level for capture X FIFOs. The capture
 * flags, STS[CFX1] and STS[CFX0], won't be set until the word count of the
 * corresponding FIFO is greater than this water mark level. (FIFO depth is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_CFXWM field. */
#define PWM_RD_CAPTCTRLX_CFXWM(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_CFXWM_MASK) >> PWM_CAPTCTRLX_CFXWM_SHIFT)
#define PWM_BRD_CAPTCTRLX_CFXWM(base, index) (PWM_RD_CAPTCTRLX_CFXWM(base, index))

/*! @brief Set the CFXWM field to a new value. */
#define PWM_WR_CAPTCTRLX_CFXWM(base, index, value) (PWM_RMW_CAPTCTRLX(base, index, PWM_CAPTCTRLX_CFXWM_MASK, PWM_CAPTCTRLX_CFXWM(value)))
#define PWM_BWR_CAPTCTRLX_CFXWM(base, index, value) (PWM_WR_CAPTCTRLX_CFXWM(base, index, value))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field CX0CNT[12:10] (RO)
 *
 * This field reflects the number of words in the Capture X0 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_CX0CNT field. */
#define PWM_RD_CAPTCTRLX_CX0CNT(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_CX0CNT_MASK) >> PWM_CAPTCTRLX_CX0CNT_SHIFT)
#define PWM_BRD_CAPTCTRLX_CX0CNT(base, index) (PWM_RD_CAPTCTRLX_CX0CNT(base, index))
/*@}*/

/*!
 * @name Register PWM_CAPTCTRLX, field CX1CNT[15:13] (RO)
 *
 * This field reflects the number of words in the Capture X1 FIFO. (FIFO depth
 * is 1)
 */
/*@{*/
/*! @brief Read current value of the PWM_CAPTCTRLX_CX1CNT field. */
#define PWM_RD_CAPTCTRLX_CX1CNT(base, index) ((PWM_CAPTCTRLX_REG(base, index) & PWM_CAPTCTRLX_CX1CNT_MASK) >> PWM_CAPTCTRLX_CX1CNT_SHIFT)
#define PWM_BRD_CAPTCTRLX_CX1CNT(base, index) (PWM_RD_CAPTCTRLX_CX1CNT(base, index))
/*@}*/

