theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*******************************************************************************
 * SIM_MISCTRL2 - Miscellaneous Control Register 2
 ******************************************************************************/

/*!
 * @brief SIM_MISCTRL2 - Miscellaneous Control Register 2 (RW)
 *
 * Reset value: 0x00000000U
 */
/*!
 * @name Constants and macros for entire SIM_MISCTRL2 register
 */
/*@{*/
#define SIM_RD_MISCTRL2(base)    (SIM_MISCTRL2_REG(base))
#define SIM_WR_MISCTRL2(base, value) (SIM_MISCTRL2_REG(base) = (value))
#define SIM_RMW_MISCTRL2(base, mask, value) (SIM_WR_MISCTRL2(base, (SIM_RD_MISCTRL2(base) & ~(mask)) | (value)))
#define SIM_SET_MISCTRL2(base, value) (SIM_WR_MISCTRL2(base, SIM_RD_MISCTRL2(base) |  (value)))
#define SIM_CLR_MISCTRL2(base, value) (SIM_WR_MISCTRL2(base, SIM_RD_MISCTRL2(base) & ~(value)))
#define SIM_TOG_MISCTRL2(base, value) (SIM_WR_MISCTRL2(base, SIM_RD_MISCTRL2(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual SIM_MISCTRL2 bitfields
 */

/*!
 * @name Register SIM_MISCTRL2, field SYNCXBARAPITTRIG0[8] (RW)
 *
 * This field controls the synchronizer between PIT trigger 0 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 0 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0 - Disable, bypass synchronizer.
 * - 1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCXBARAPITTRIG0 field. */
#define SIM_RD_MISCTRL2_SYNCXBARAPITTRIG0(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCXBARAPITTRIG0_MASK) >> SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCXBARAPITTRIG0(base) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT))

/*! @brief Set the SYNCXBARAPITTRIG0 field to a new value. */
#define SIM_WR_MISCTRL2_SYNCXBARAPITTRIG0(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCXBARAPITTRIG0_MASK, SIM_MISCTRL2_SYNCXBARAPITTRIG0(value)))
#define SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG0(base, value) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCXBARAPITTRIG1[9] (RW)
 *
 * This field controls the synchronizer between PIT trigger 1 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 1 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0 - Disable, bypass synchronizer.
 * - 1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCXBARAPITTRIG1 field. */
#define SIM_RD_MISCTRL2_SYNCXBARAPITTRIG1(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCXBARAPITTRIG1_MASK) >> SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCXBARAPITTRIG1(base) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT))

/*! @brief Set the SYNCXBARAPITTRIG1 field to a new value. */
#define SIM_WR_MISCTRL2_SYNCXBARAPITTRIG1(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCXBARAPITTRIG1_MASK, SIM_MISCTRL2_SYNCXBARAPITTRIG1(value)))
#define SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG1(base, value) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG1_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCXBARAPITTRIG2[10] (RW)
 *
 * This field controls the synchronizer between PIT trigger 2 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 2 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0 - Disable, bypass synchronizer.
 * - 1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCXBARAPITTRIG2 field. */
#define SIM_RD_MISCTRL2_SYNCXBARAPITTRIG2(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCXBARAPITTRIG2_MASK) >> SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCXBARAPITTRIG2(base) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT))

/*! @brief Set the SYNCXBARAPITTRIG2 field to a new value. */
#define SIM_WR_MISCTRL2_SYNCXBARAPITTRIG2(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCXBARAPITTRIG2_MASK, SIM_MISCTRL2_SYNCXBARAPITTRIG2(value)))
#define SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG2(base, value) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG2_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCXBARAPITTRIG3[11] (RW)
 *
 * This field controls the synchronizer between PIT trigger 3 and XBARA's input.
 * Set this bit if the XBARA's input PIT trigger 3 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0 - Disable, bypass synchronizer.
 * - 1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCXBARAPITTRIG3 field. */
#define SIM_RD_MISCTRL2_SYNCXBARAPITTRIG3(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCXBARAPITTRIG3_MASK) >> SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCXBARAPITTRIG3(base) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT))

/*! @brief Set the SYNCXBARAPITTRIG3 field to a new value. */
#define SIM_WR_MISCTRL2_SYNCXBARAPITTRIG3(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCXBARAPITTRIG3_MASK, SIM_MISCTRL2_SYNCXBARAPITTRIG3(value)))
#define SIM_BWR_MISCTRL2_SYNCXBARAPITTRIG3(base, value) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARAPITTRIG3_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCXBARBPITTRIG0[12] (RW)
 *
 * This field controls the synchronizer between PIT trigger 0 and XBARB's input.
 * Set this bit if the XBARB's input PIT trigger 0 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0 - Disable, bypass synchronizer.
 * - 1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCXBARBPITTRIG0 field. */
#define SIM_RD_MISCTRL2_SYNCXBARBPITTRIG0(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCXBARBPITTRIG0_MASK) >> SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCXBARBPITTRIG0(base) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT))

/*! @brief Set the SYNCXBARBPITTRIG0 field to a new value. */
#define SIM_WR_MISCTRL2_SYNCXBARBPITTRIG0(base, value) (SIM_RMW_MISCTRL2(base, SIM_MISCTRL2_SYNCXBARBPITTRIG0_MASK, SIM_MISCTRL2_SYNCXBARBPITTRIG0(value)))
#define SIM_BWR_MISCTRL2_SYNCXBARBPITTRIG0(base, value) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARBPITTRIG0_SHIFT) = (value))
/*@}*/

/*!
 * @name Register SIM_MISCTRL2, field SYNCXBARBPITTRIG1[13] (RW)
 *
 * This field controls the synchronizer between PIT trigger 1 and XBARB's input.
 * Set this bit if the XBARB's input PIT trigger 1 is fed into fast peripherials
 * through xbar.
 *
 * Values:
 * - 0 - Disable, bypass synchronizer.
 * - 1 - Enable.
 */
/*@{*/
/*! @brief Read current value of the SIM_MISCTRL2_SYNCXBARBPITTRIG1 field. */
#define SIM_RD_MISCTRL2_SYNCXBARBPITTRIG1(base) ((SIM_MISCTRL2_REG(base) & SIM_MISCTRL2_SYNCXBARBPITTRIG1_MASK) >> SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT)
#define SIM_BRD_MISCTRL2_SYNCXBARBPITTRIG1(base) (BITBAND_ACCESS32(&SIM_MISCTRL2_REG(base), SIM_MISCTRL2_SYNCXBARBPITTRIG1_SHIFT))

