theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*******************************************************************************
 * XBARA_SEL5 - Crossbar A Select Register 5
 ******************************************************************************/

/*!
 * @brief XBARA_SEL5 - Crossbar A Select Register 5 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL5 register
 */
/*@{*/
#define XBARA_RD_SEL5(base)      (XBARA_SEL5_REG(base))
#define XBARA_WR_SEL5(base, value) (XBARA_SEL5_REG(base) = (value))
#define XBARA_RMW_SEL5(base, mask, value) (XBARA_WR_SEL5(base, (XBARA_RD_SEL5(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL5(base, value) (XBARA_WR_SEL5(base, XBARA_RD_SEL5(base) |  (value)))
#define XBARA_CLR_SEL5(base, value) (XBARA_WR_SEL5(base, XBARA_RD_SEL5(base) & ~(value)))
#define XBARA_TOG_SEL5(base, value) (XBARA_WR_SEL5(base, XBARA_RD_SEL5(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL5 bitfields
 */

/*!
 * @name Register XBARA_SEL5, field SEL10[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT10 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL5_SEL10 field. */
#define XBARA_RD_SEL5_SEL10(base) ((XBARA_SEL5_REG(base) & XBARA_SEL5_SEL10_MASK) >> XBARA_SEL5_SEL10_SHIFT)
#define XBARA_BRD_SEL5_SEL10(base) (XBARA_RD_SEL5_SEL10(base))

/*! @brief Set the SEL10 field to a new value. */
#define XBARA_WR_SEL5_SEL10(base, value) (XBARA_RMW_SEL5(base, XBARA_SEL5_SEL10_MASK, XBARA_SEL5_SEL10(value)))
#define XBARA_BWR_SEL5_SEL10(base, value) (XBARA_WR_SEL5_SEL10(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL5, field SEL11[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT11 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL5_SEL11 field. */
#define XBARA_RD_SEL5_SEL11(base) ((XBARA_SEL5_REG(base) & XBARA_SEL5_SEL11_MASK) >> XBARA_SEL5_SEL11_SHIFT)
#define XBARA_BRD_SEL5_SEL11(base) (XBARA_RD_SEL5_SEL11(base))

/*! @brief Set the SEL11 field to a new value. */
#define XBARA_WR_SEL5_SEL11(base, value) (XBARA_RMW_SEL5(base, XBARA_SEL5_SEL11_MASK, XBARA_SEL5_SEL11(value)))
#define XBARA_BWR_SEL5_SEL11(base, value) (XBARA_WR_SEL5_SEL11(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL6 - Crossbar A Select Register 6
 ******************************************************************************/

/*!
 * @brief XBARA_SEL6 - Crossbar A Select Register 6 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL6 register
 */
/*@{*/
#define XBARA_RD_SEL6(base)      (XBARA_SEL6_REG(base))
#define XBARA_WR_SEL6(base, value) (XBARA_SEL6_REG(base) = (value))
#define XBARA_RMW_SEL6(base, mask, value) (XBARA_WR_SEL6(base, (XBARA_RD_SEL6(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL6(base, value) (XBARA_WR_SEL6(base, XBARA_RD_SEL6(base) |  (value)))
#define XBARA_CLR_SEL6(base, value) (XBARA_WR_SEL6(base, XBARA_RD_SEL6(base) & ~(value)))
#define XBARA_TOG_SEL6(base, value) (XBARA_WR_SEL6(base, XBARA_RD_SEL6(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL6 bitfields
 */

/*!
 * @name Register XBARA_SEL6, field SEL12[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT12 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL6_SEL12 field. */
#define XBARA_RD_SEL6_SEL12(base) ((XBARA_SEL6_REG(base) & XBARA_SEL6_SEL12_MASK) >> XBARA_SEL6_SEL12_SHIFT)
#define XBARA_BRD_SEL6_SEL12(base) (XBARA_RD_SEL6_SEL12(base))

/*! @brief Set the SEL12 field to a new value. */
#define XBARA_WR_SEL6_SEL12(base, value) (XBARA_RMW_SEL6(base, XBARA_SEL6_SEL12_MASK, XBARA_SEL6_SEL12(value)))
#define XBARA_BWR_SEL6_SEL12(base, value) (XBARA_WR_SEL6_SEL12(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL6, field SEL13[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT13 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL6_SEL13 field. */
#define XBARA_RD_SEL6_SEL13(base) ((XBARA_SEL6_REG(base) & XBARA_SEL6_SEL13_MASK) >> XBARA_SEL6_SEL13_SHIFT)
#define XBARA_BRD_SEL6_SEL13(base) (XBARA_RD_SEL6_SEL13(base))

/*! @brief Set the SEL13 field to a new value. */
#define XBARA_WR_SEL6_SEL13(base, value) (XBARA_RMW_SEL6(base, XBARA_SEL6_SEL13_MASK, XBARA_SEL6_SEL13(value)))
#define XBARA_BWR_SEL6_SEL13(base, value) (XBARA_WR_SEL6_SEL13(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL7 - Crossbar A Select Register 7
 ******************************************************************************/

/*!
 * @brief XBARA_SEL7 - Crossbar A Select Register 7 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL7 register
 */
/*@{*/
#define XBARA_RD_SEL7(base)      (XBARA_SEL7_REG(base))
#define XBARA_WR_SEL7(base, value) (XBARA_SEL7_REG(base) = (value))
#define XBARA_RMW_SEL7(base, mask, value) (XBARA_WR_SEL7(base, (XBARA_RD_SEL7(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL7(base, value) (XBARA_WR_SEL7(base, XBARA_RD_SEL7(base) |  (value)))
#define XBARA_CLR_SEL7(base, value) (XBARA_WR_SEL7(base, XBARA_RD_SEL7(base) & ~(value)))
#define XBARA_TOG_SEL7(base, value) (XBARA_WR_SEL7(base, XBARA_RD_SEL7(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL7 bitfields
 */

/*!
 * @name Register XBARA_SEL7, field SEL14[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT14 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL7_SEL14 field. */
#define XBARA_RD_SEL7_SEL14(base) ((XBARA_SEL7_REG(base) & XBARA_SEL7_SEL14_MASK) >> XBARA_SEL7_SEL14_SHIFT)
#define XBARA_BRD_SEL7_SEL14(base) (XBARA_RD_SEL7_SEL14(base))

/*! @brief Set the SEL14 field to a new value. */
#define XBARA_WR_SEL7_SEL14(base, value) (XBARA_RMW_SEL7(base, XBARA_SEL7_SEL14_MASK, XBARA_SEL7_SEL14(value)))
#define XBARA_BWR_SEL7_SEL14(base, value) (XBARA_WR_SEL7_SEL14(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL7, field SEL15[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT15 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL7_SEL15 field. */
#define XBARA_RD_SEL7_SEL15(base) ((XBARA_SEL7_REG(base) & XBARA_SEL7_SEL15_MASK) >> XBARA_SEL7_SEL15_SHIFT)
#define XBARA_BRD_SEL7_SEL15(base) (XBARA_RD_SEL7_SEL15(base))

