theatrus/ksdk/platform/devices/MKV44F15/include/MKV44F15_extension.h
/*
 * Constants & macros for individual XBARA_SEL19 bitfields
 */

/*!
 * @name Register XBARA_SEL19, field SEL38[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT38 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL19_SEL38 field. */
#define XBARA_RD_SEL19_SEL38(base) ((XBARA_SEL19_REG(base) & XBARA_SEL19_SEL38_MASK) >> XBARA_SEL19_SEL38_SHIFT)
#define XBARA_BRD_SEL19_SEL38(base) (XBARA_RD_SEL19_SEL38(base))

/*! @brief Set the SEL38 field to a new value. */
#define XBARA_WR_SEL19_SEL38(base, value) (XBARA_RMW_SEL19(base, XBARA_SEL19_SEL38_MASK, XBARA_SEL19_SEL38(value)))
#define XBARA_BWR_SEL19_SEL38(base, value) (XBARA_WR_SEL19_SEL38(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL19, field SEL39[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT39 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL19_SEL39 field. */
#define XBARA_RD_SEL19_SEL39(base) ((XBARA_SEL19_REG(base) & XBARA_SEL19_SEL39_MASK) >> XBARA_SEL19_SEL39_SHIFT)
#define XBARA_BRD_SEL19_SEL39(base) (XBARA_RD_SEL19_SEL39(base))

/*! @brief Set the SEL39 field to a new value. */
#define XBARA_WR_SEL19_SEL39(base, value) (XBARA_RMW_SEL19(base, XBARA_SEL19_SEL39_MASK, XBARA_SEL19_SEL39(value)))
#define XBARA_BWR_SEL19_SEL39(base, value) (XBARA_WR_SEL19_SEL39(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL20 - Crossbar A Select Register 20
 ******************************************************************************/

/*!
 * @brief XBARA_SEL20 - Crossbar A Select Register 20 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL20 register
 */
/*@{*/
#define XBARA_RD_SEL20(base)     (XBARA_SEL20_REG(base))
#define XBARA_WR_SEL20(base, value) (XBARA_SEL20_REG(base) = (value))
#define XBARA_RMW_SEL20(base, mask, value) (XBARA_WR_SEL20(base, (XBARA_RD_SEL20(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL20(base, value) (XBARA_WR_SEL20(base, XBARA_RD_SEL20(base) |  (value)))
#define XBARA_CLR_SEL20(base, value) (XBARA_WR_SEL20(base, XBARA_RD_SEL20(base) & ~(value)))
#define XBARA_TOG_SEL20(base, value) (XBARA_WR_SEL20(base, XBARA_RD_SEL20(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL20 bitfields
 */

/*!
 * @name Register XBARA_SEL20, field SEL40[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT40 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL20_SEL40 field. */
#define XBARA_RD_SEL20_SEL40(base) ((XBARA_SEL20_REG(base) & XBARA_SEL20_SEL40_MASK) >> XBARA_SEL20_SEL40_SHIFT)
#define XBARA_BRD_SEL20_SEL40(base) (XBARA_RD_SEL20_SEL40(base))

/*! @brief Set the SEL40 field to a new value. */
#define XBARA_WR_SEL20_SEL40(base, value) (XBARA_RMW_SEL20(base, XBARA_SEL20_SEL40_MASK, XBARA_SEL20_SEL40(value)))
#define XBARA_BWR_SEL20_SEL40(base, value) (XBARA_WR_SEL20_SEL40(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL20, field SEL41[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT41 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL20_SEL41 field. */
#define XBARA_RD_SEL20_SEL41(base) ((XBARA_SEL20_REG(base) & XBARA_SEL20_SEL41_MASK) >> XBARA_SEL20_SEL41_SHIFT)
#define XBARA_BRD_SEL20_SEL41(base) (XBARA_RD_SEL20_SEL41(base))

/*! @brief Set the SEL41 field to a new value. */
#define XBARA_WR_SEL20_SEL41(base, value) (XBARA_RMW_SEL20(base, XBARA_SEL20_SEL41_MASK, XBARA_SEL20_SEL41(value)))
#define XBARA_BWR_SEL20_SEL41(base, value) (XBARA_WR_SEL20_SEL41(base, value))
/*@}*/

/*******************************************************************************
 * XBARA_SEL21 - Crossbar A Select Register 21
 ******************************************************************************/

/*!
 * @brief XBARA_SEL21 - Crossbar A Select Register 21 (RW)
 *
 * Reset value: 0x0000U
 */
/*!
 * @name Constants and macros for entire XBARA_SEL21 register
 */
/*@{*/
#define XBARA_RD_SEL21(base)     (XBARA_SEL21_REG(base))
#define XBARA_WR_SEL21(base, value) (XBARA_SEL21_REG(base) = (value))
#define XBARA_RMW_SEL21(base, mask, value) (XBARA_WR_SEL21(base, (XBARA_RD_SEL21(base) & ~(mask)) | (value)))
#define XBARA_SET_SEL21(base, value) (XBARA_WR_SEL21(base, XBARA_RD_SEL21(base) |  (value)))
#define XBARA_CLR_SEL21(base, value) (XBARA_WR_SEL21(base, XBARA_RD_SEL21(base) & ~(value)))
#define XBARA_TOG_SEL21(base, value) (XBARA_WR_SEL21(base, XBARA_RD_SEL21(base) ^  (value)))
/*@}*/

/*
 * Constants & macros for individual XBARA_SEL21 bitfields
 */

/*!
 * @name Register XBARA_SEL21, field SEL42[5:0] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT42 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL21_SEL42 field. */
#define XBARA_RD_SEL21_SEL42(base) ((XBARA_SEL21_REG(base) & XBARA_SEL21_SEL42_MASK) >> XBARA_SEL21_SEL42_SHIFT)
#define XBARA_BRD_SEL21_SEL42(base) (XBARA_RD_SEL21_SEL42(base))

/*! @brief Set the SEL42 field to a new value. */
#define XBARA_WR_SEL21_SEL42(base, value) (XBARA_RMW_SEL21(base, XBARA_SEL21_SEL42_MASK, XBARA_SEL21_SEL42(value)))
#define XBARA_BWR_SEL21_SEL42(base, value) (XBARA_WR_SEL21_SEL42(base, value))
/*@}*/

/*!
 * @name Register XBARA_SEL21, field SEL43[13:8] (RW)
 *
 * Input (XBARA_INn) to be muxed to XBARA_OUT43 (refer to Functional Description
 * section for input/output assignment)
 */
/*@{*/
/*! @brief Read current value of the XBARA_SEL21_SEL43 field. */
#define XBARA_RD_SEL21_SEL43(base) ((XBARA_SEL21_REG(base) & XBARA_SEL21_SEL43_MASK) >> XBARA_SEL21_SEL43_SHIFT)
#define XBARA_BRD_SEL21_SEL43(base) (XBARA_RD_SEL21_SEL43(base))

/*! @brief Set the SEL43 field to a new value. */
#define XBARA_WR_SEL21_SEL43(base, value) (XBARA_RMW_SEL21(base, XBARA_SEL21_SEL43_MASK, XBARA_SEL21_SEL43(value)))
#define XBARA_BWR_SEL21_SEL43(base, value) (XBARA_WR_SEL21_SEL43(base, value))
/*@}*/

